---
title: PhaseArray
classe: Autodesk.Revit.DB.PhaseArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# PhaseArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `phaseArray.IsEmpty` | Boolean |
| `Phase Item { get; set; }` | `phaseArray.Item` | Phase |
| `Int32 Size { get; }` | `phaseArray.Size` | Int32 |
| `Void Append(Phase)` | `phaseArray.Append(item)` | Void |
| `Void Clear()` | `phaseArray.Clear()` | Void |
| `PhaseArrayIterator ForwardIterator()` | `phaseArray.ForwardIterator()` | PhaseArrayIterator |
| `IEnumerator GetEnumerator()` | `phaseArray.GetEnumerator()` | IEnumerator |
| `Void Insert(Phase, Int32)` | `phaseArray.Insert(item, index)` | Void |
| `PhaseArrayIterator ReverseIterator()` | `phaseArray.ReverseIterator()` | PhaseArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```